export const addressData = {
  서울특별시: {
    광진구: {
      자양1동: [''],
      자양2동: [''],
      자양3동: [''],
      자양4동: [''],
      구의동: [''],
    },
    성동구: {
      성수동: [''],
    },
    강남구: {
      역삼동: [''],
      삼성동: [''],
      청담동: [''],
      논현동: [''],
    },
    강동구: {
      천호동: [''],
      둔촌동: [''],
      성내동: [''],
      암사동: [''],
    },
    서초구: {
      서초동: [''],
      방배동: [''],
      잠원동: [''],
    },
    마포구: {
      합정동: [''],
      서교동: [''],
      망원동: [''],
      상암동: [''],
    },
  },

  // 이미 4단계 구조인 경기도는 그대로 유지
  경기도: {
    수원시: {
      장안구: {
        영화동: [''],
        정자1동: [''],
        정자2동: [''],
      },
      팔달구: {
        인계동: [''],
        매교동: [''],
        우만동: [''],
      },
      권선구: {
        권선동: [''],
        곡선동: [''],
      },
    },
    성남시: {
      분당구: {
        정자동: [''],
        서현동: [''],
        수내동: [''],
      },
      수정구: {
        태평동: [''],
        수진동: [''],
      },
    },
    고양시: {
      일산서구: {
        주엽동: [''],
        대화동: [''],
      },
      덕양구: {
        화정동: [''],
        행신동: [''],
      },
    },
  },
};
